app/Controllers/dashboard.php

    public function index()
    {
        $model = new ModelBarang();

        // Mengambil semua data dari tabel tb_matkul
        $data['matkul'] = $model->findAll();
---
SELECT *
FROM `tb_matkul`